kiooss/esp32s3-gamebox/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash: ESP32-S3-WROOM-1-N16R8 = 16 MB quad flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM: N16R8 = 8 MB OCTAL SPI. OCT 模式是关键，选错则 PSRAM 不可用。
# 启用后 GPIO33~37 被占用，不可作普通 IO —— 详见 docs/hardware.md
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# 普通 malloc 也可以使用 PSRAM。16 KB 以下优先内部 SRAM，保住小对象/控制结构的
# 访问速度；更大的模拟器数组优先 PSRAM。只是优先级，不是硬保证；关键缓冲仍用
# heap_caps_malloc 明确指定位置。完整分配账见 docs/memory.md。
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# 开了 PSRAM 之后，IDF 会从内部 RAM 划一块「只给内部/DMA 用」的保留池，默认 32 KB。
# 那 32 KB 是给 WiFi/BT 这类必须用内部 DMA 内存的驱动留的，本项目两样都不用 ——
# 自己要的内部 DMA 内存只有 SPI 描述符和几百字节的行缓冲。
# 降到 8 KB 把 24 KB 还给帧缓冲：画布高度直接卡在这几 KB 上（见 display.h）。
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192

# CPU 跑满 240MHz。默认是 160MHz —— 白扔 1/3 算力，模拟器要靠这个。
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# printf 需要完整浮点格式化
CONFIG_NEWLIB_NANO_FORMAT=n

# FreeRTOS tick 提到 1000 Hz。默认 100 Hz 意味着 vTaskDelay 最小粒度 10ms，
# 而 NES 一帧才 16.7ms —— 配速会被抖成锯齿。
CONFIG_FREERTOS_HZ=1000

# 自定义分区表：2 MB app + 13 MB roms + 960 KB SNES 存档。见 partitions.csv。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
